-- AUDITORIUM_TYPE
CREATE TABLE AUDITORIUM_TYPE
(
    AUDITORIUM_TYPE char(10) CONSTRAINT AUDITORIUM_TYPE_PK PRIMARY KEY,
    AUDITORIUM_TYPENAME varchar(30)
);
GO

select * from pulpit;

INSERT INTO dbo.AUDITORIUM_TYPE (AUDITORIUM_TYPE, AUDITORIUM_TYPENAME) VALUES
('ЛК',   'Лекционная'),
('ЛБ-К', 'Компьютерный класс'),
('ЛК-К', 'Лекционная с уст. проектором'),
('ЛБ-X', 'Химическая лаборатория'),
('ЛБ-СК','Спец. компьютерный класс');
GO

select * from AUDITORIUM_TYPE;

-- AUDITORIUM
CREATE TABLE AUDITORIUM
(
    AUDITORIUM char(20) CONSTRAINT AUDITORIUM_PK PRIMARY KEY,
    AUDITORIUM_TYPE char(10)
        CONSTRAINT AUDITORIUM_AUDITORIUM_TYPE_FK
        FOREIGN KEY REFERENCES AUDITORIUM_TYPE(AUDITORIUM_TYPE),
    AUDITORIUM_CAPACITY integer CONSTRAINT AUDITORIUM_CAPACITY_CHECK DEFAULT 1 CHECK (AUDITORIUM_CAPACITY BETWEEN 1 AND 300),
    AUDITORIUM_NAME varchar(50)
);
GO

INSERT INTO dbo.AUDITORIUM (AUDITORIUM, AUDITORIUM_NAME, AUDITORIUM_TYPE, AUDITORIUM_CAPACITY) VALUES
('206-1','206-1','ЛБ-К',15),
('301-1','301-1','ЛБ-К',15),
('236-1','236-1','ЛК',60),
('313-1','313-1','ЛК-К',60),
('324-1','324-1','ЛК-К',50),
('413-1','413-1','ЛБ-К',15),
('423-1','423-1','ЛБ-К',90),
('408-2','408-2','ЛК',90);
GO

-- FACULTY
CREATE TABLE FACULTY
(
    FACULTY nvarchar(10) PRIMARY KEY,
    FACULTY_NAME nvarchar(50) DEFAULT N'Не указано'
);
GO

INSERT INTO dbo.FACULTY (FACULTY, FACULTY_NAME) VALUES
(N'ХТиТ', N'Химическая технология и техника'),
(N'ЛХФ', N'Лесохозяйственный факультет'),
(N'ИЭФ', N'Инженерно-экономический факультет'),
(N'ТТЛП', N'Технология и техника лесной промышленности'),
(N'ТОВ', N'Технология органических веществ'),
(N'ИТ', N'Факультет информационных технологий'),
(N'ИДиП', N'Издательское дело и полиграфия');
GO

-- PULPIT
CREATE TABLE PULPIT
(
    PULPIT nvarchar(20) PRIMARY KEY,
    PULPIT_NAME nvarchar(100),
    FACULTY nvarchar(10) FOREIGN KEY REFERENCES FACULTY(FACULTY)
);
GO

INSERT INTO dbo.PULPIT (PULPIT, PULPIT_NAME, FACULTY) VALUES
('ИСиТ', 'Информационных систем и технологий', 'ИТ'),
('ЛВ', 'Лесоводства', 'ЛХФ'),
('ЛУ', 'Лесоустройства', 'ЛХФ'),
('ЛЗиДВ', 'Лесозащиты и древесиноведения', 'ЛХФ'),
('ЛКиП', 'Лесных культур и почвоведения', 'ЛХФ'),
('ТиП', 'Туризма и природопользования', 'ЛХФ'),
('ЛПиСПС','Ландшафтного проектирования и садово-паркового строительства','ЛХФ'),
('ТЛ', 'Транспорта леса', 'ТТЛП'),
('ЛМиЛЗ','Лесных машин и технологии лесозаготовок','ТТЛП'),
('ТДП','Технологий деревообрабатывающих производств','ТТЛП'),
('ТиДИД','Технологии и дизайна изделий из древесины','ТТЛП'),
('ОХ', 'Органической химии','ТОВ'),
('ХПД','Химической переработки древесины','ТОВ'),
('ТНВиОХТ','Технологии неорганических веществ и общей химической технологии','ХТиТ'),
('ПиАХП','Процессов и аппаратов химических производств','ХТиТ'),
('ЭТиМ','Экономической теории и маркетинга','ИЭФ'),
('МиЭП','Менеджмента и экономики природопользования','ИЭФ'),
('СБУАиА','Статистики, бухгалтерского учета, анализа и аудита','ИЭФ'),
('ПОиСОИ','Полиграфического оборудования и систем обработки информации','ИДиП'),
('БФ','Белорусской филологии','ИДиП'),
('РИТ','Редакционно-издательских тенологий','ИДиП'),
('ПП','Полиграфических производств','ИДиП');
GO

-- TEACHER
CREATE TABLE TEACHER
(
    TEACHER nvarchar(10) PRIMARY KEY,
    TEACHER_NAME nvarchar(50),
    GENDER nvarchar(1) CHECK (GENDER IN (N'м', N'ж')),
    PULPIT nvarchar(20) FOREIGN KEY REFERENCES PULPIT(PULPIT)
);
GO

INSERT INTO dbo.TEACHER (TEACHER, TEACHER_NAME, GENDER, PULPIT) VALUES
('СМЛВ','Смелов Владимир Владиславович','м','ИСиТ'),
('АКНВЧ','Акунович Станислав Иванович','м','ИСиТ'),
('КЛСНВ','Колесников Виталий Леонидович','м','ИСиТ'),
('БРКВЧ','Бракович Андрей Игоревич','м','ИСиТ'),
('ДТК','Дятко Александр Аркадьевич','м','ИСиТ'),
('УРБ','Урбанович Павел Павлович','м','ИСиТ'),
('ГРН','Гурин Николай Иванович','м','ИСиТ'),
('ЖЛК','Жиляк Надежда Александровна','ж','ИСиТ'),
('МРЗ','Мороз Елена Станиславовна','ж','ИСиТ'),
('БРНВСК','Барановский Станислав Иванович','м','ЭТиМ'),
('НВРВ','Неверов Александр Васильевич','м','МиЭП'),
('ДМДК','Демидко Марина Николаевна','ж','ЛПиСПС'),
('БРГ','Бурганская Татьяна Минаевна','ж','ЛПиСПС'),
('РЖК','Рожков Леонид Николаевич','м','ЛВ'),
('ЗВГЦВ','Звягинцев Вячеслав Борисович','м','ЛЗиДВ'),
('БЗБРДВ','Безбородов Владимир Степанович','м','ОХ'),
('НСКВЦ','Насковец Михаил Трофимович','м','ТЛ'),
('БРТШВЧ','Барташевич Святослав Александрович','м','ПОиСОИ'),
('АРС','Арсентьев Виталий Арсентьевич','м','ПОиСОИ');
GO

-- SUBJECT
CREATE TABLE SUBJECT
(
    [SUBJECT] nvarchar(10) PRIMARY KEY,
    SUBJECT_NAME nvarchar(100) UNIQUE,
    PULPIT nvarchar(20) FOREIGN KEY REFERENCES PULPIT(PULPIT)
);
GO

INSERT INTO dbo.SUBJECT ([SUBJECT], SUBJECT_NAME, PULPIT) VALUES
('СУБД','Системы управления базами данных','ИСиТ'),
('БД','Базы данных','ИСиТ'),
('ИНФ','Информационные технологии','ИСиТ'),
('ОАиП','Основы алгоритмизации и программирования','ИСиТ'),
('ПЗ','Представление знаний в компьютерных системах','ИСиТ'),
('ПСП','Программирование сетевых приложений','ИСиТ'),
('МСОИ','Моделирование систем обработки информации','ИСиТ'),
('ПИС','Проектирование информационных систем','ИСиТ'),
('КГ','Компьютерная геометрия','ИСиТ'),
('КМС','Компьютерные мультимедийные системы','ИСиТ'),
('ДМ','Дискретная математика','ИСиТ'),
('МП','Математическое программирование','ИСиТ'),
('ЛЭВМ','Логические основы ЭВМ','ИСиТ'),
('ООП','Объектно-ориентированное программирование','ИСиТ'),
('ЭП','Экономика природопользования','МиЭП'),
('ЭТ','Экономическая теория','ЭТиМ'),
('ОСПиЛПХ','Основы садово-паркового и лесопаркового хозяйства','ЛПиСПС'),
('ИГ','Инженерная геодезия','ЛУ'),
('ЛВ','Лесоводство','ЛЗиДВ'),
('ОХ','Органическая химия','ОХ'),
('ВТЛ','Водный транспорт леса','ТЛ'),
('ТиОЛ','Технология и оборудование лесозаготовок','ЛМиЛЗ'),
('ТОПИ','Технология обогащения полезных ископаемых','ТНВиОХТ'),
('ПМАПЛ','Полиграф. машины, автоматы и поточные линии','ПОиСОИ'),
('ОПП','Организация полиграф. производства','ПОиСОИ');
GO

select * from subject
